{"data":{"post":{"id":"9cb2bac8-53ba-55fc-acc0-f56ba4f02273","html":"<p>:100 Welcome to my first blog, M0Nk3y WebDev :sparkler!! After witnessing tons of cool blogs written by other developers, learning all sorts of practical tips and gaining incredibly useful knowledge thru thoughtfully written tutorials, it was a no-brainer to me that someday I’d create one, aswell. Surprise, surprise that day is today :smile lols. I hope somebody learns something that’ll help them create their web app and further their education towards software development!</p>\n<p>:100 For my first post, I’ll show you how I created this blog, step by step. After trying multiple different frameworks, :cough <a href=\"https://jekyllrb.com\">Jekyll</a>, :cough <a href=\"https://wordpress.org/\">WordPress</a>, I finally landed on <a href=\"https://www.gatsbyjs.org/\">Gatsby.js</a>. Although both former frameworks worked well and provided everything necessary to create a nice blog, they weren’t flexible enough for what I was after, especially after starting to use <a href=\"https://reactjs.org/\">React.js</a>, <a href=\"https://redux.js.org/\">Redux.js</a>, and <a href=\"https://vuejs.org/\">Vue.js</a>. <a href=\"https://www.gatsbyjs.org/\">Gatsby’s</a> true strength lies in it’s component based system while mainting static site builds, hence compatability with <a href=\"https://pages.github.com/\">Github Pages</a>, and other free web hosts. So, without further ado, here’s the steps I took to build this blog using <a href=\"https://www.gatsbyjs.org/\">gatsby</a>:</p>","fields":{"slug":"/first-post-thanks-to-gatsby/","prefix":"2018-11-07"},"frontmatter":{"title":"First post brought to you by Gatsby!","author":"Todd Matheson","category":"testimonies","cover":{"childImageSharp":{"resize":{"src":"/static/light-sky-recreation-japan-festival-fireworks-1016653-pxhere.com-c732a1bcb532d90f229615798ed861c4-ada8c.jpg"}}}}},"authornote":{"id":"d0ad3b4d-98b0-5b9a-a1e9-1862ee9b75cb","html":"<p><strong>Mr. Gatsby</strong> Proin ornare ligula eu tellus tempus elementum. Aenean <a href=\"/\">bibendum</a> iaculis mi, nec blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus. Blandit lacus interdum vitae. Vestibulum non nibh risus, a scelerisque purus.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/first-post-thanks-to-gatsby/","prev":{"id":"a904e61f-bbee-50d7-9be0-9a6ce6098517","fields":{"slug":"/like-nonsense/","prefix":"2017-10-21","source":"posts"},"frontmatter":{"title":"I like nonsense, it wakes up the brain cells","category":"testimonies"}},"source":"posts"}}